<!DOCTYPE HTML>
<!--
	Editorial by HTML5 UP
	html5up.net | @ajlkn
	Free for personal and commercial use under the CCA 3.0 license (html5up.net/license)

	000 Wiki made with love and care by the following people:
	- Mick Douglas (@BetterSafetyNet) -- Tech lead, Intern Wrangler, InfoSec Innovations
		- Yulli Chong, Intern, InfoSec Innovations
		- Aaron Sawyer, Intern, InfoSec Innovations
	- John Strand (@strandjs) -- Project Lead, BHIS
		- James Maars, Intern BHIS 
		- Derrick Rauch, Intern BHIS

-->
<html>
	<head>
		<title>SANS SEC000 Lab Workbook</title>
		<meta charset="utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no" />
		<link rel="stylesheet" href="css/main.css" />
	</head>
	<body>

		<!-- Wrapper -->
			<div id="wrapper">

				<!-- Main -->
					<div id="main">
						<div class="inner">
							<!-- Content -->
							<!-- Converted Markdown body (AKA HTML stubs) goes here -->
<h1 id="sans-security-504&#12521;&#12508;wiki&#12408;&#12424;&#12358;&#12371;&#12381;">SANS Security 504&#12521;&#12508;Wiki&#12408;&#12424;&#12358;&#12371;&#12381;!</h1>
<p>&#12371;&#12398;Wiki&#12391;SANS SEC504&#12398;&#12521;&#12508;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;&#12521;&#12508;&#12434;&#24120;&#12395;&#26368;&#26032;&#12391;&#12289;&#12414;&#12383;&#65288;&#12467;&#12500;&#12540;&#65286;&#12506;&#12540;&#12473;&#12488;&#12391;&#12365;&#12427;&#12424;&#12358;&#65289;&#12424;&#12426;&#20351;&#12356;&#12420;&#12377;&#12367;&#12289;&#12459;&#12521;&#12540;&#12391;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#25552;&#20379;&#12377;&#12427;&#30446;&#30340;&#12391;HTML&#24418;&#24335;&#12391;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12393;&#12371;&#12391;&#12418;&#21193;&#24375;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#65288;&#12414;&#12383;GIAC&#35430;&#39443;&#12434;&#21463;&#12369;&#12427;&#12392;&#12365;&#12395;&#12486;&#12473;&#12488;&#12475;&#12531;&#12479;&#12540;&#12395;&#25345;&#12385;&#36796;&#12417;&#12427;&#12424;&#12358;&#12395;&#65289;&#12371;&#12398;Wiki&#12398;&#21360;&#21047;&#29289;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<blockquote>
<p>&#12371;&#12398;&#12521;&#12508;&#12398;Wiki&#12399;&#12467;&#12540;&#12473;&#20316;&#32773;&#12395;&#12424;&#12387;&#12390;&#38971;&#32321;&#12395;&#26356;&#26032;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; &#30342;&#12373;&#12435;&#12398;&#12383;&#12417;&#12395;&#12521;&#12508;&#12398;&#21697;&#36074;&#12434;&#21521;&#19978;&#12375;&#12383;&#12426;&#35492;&#26893;&#12434;&#35330;&#27491;&#12375;&#12383;&#12426;&#12289;&#26032;&#12375;&#12356;&#12521;&#12508;&#12434;&#36861;&#21152;&#12375;&#12383;&#12426;&#12375;&#12390;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;</p>
</blockquote>
<h2 id="&#12521;&#12508;wiki&#12398;&#12487;&#12472;&#12479;&#12523;&#29256;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;">&#12521;&#12508;Wiki&#12398;&#12487;&#12472;&#12479;&#12523;&#29256;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;</h2>
<p>Slingshot Linux VM&#12363;&#12425;&#12521;&#12508;Wiki&#12398;&#12487;&#12472;&#12479;&#12523;&#29256;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12398;&#12395;Firefox&#12502;&#12521;&#12454;&#12470;&#12434;&#38283;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12364;&#12521;&#12508;Wiki&#12394;&#12398;&#12391;&#12289;&#24038;&#20596;&#12398;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12467;&#12540;&#12473;&#12521;&#12508;&#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#21516;&#12376;&#12424;&#12358;&#12395;Windows 10 VM&#12363;&#12425;&#12418;&#12521;&#12508;Wiki&#12398;&#12487;&#12472;&#12479;&#12523;&#29256;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;Chrome&#12434;&#38283;&#12367;&#12392;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12364;&#12521;&#12508;Wiki&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<h2 id="&#12521;&#12508;wiki&#12398;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;--linux">&#12521;&#12508;Wiki&#12398;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488; &ndash; Linux</h2>
<p>Linux VM&#12391;&#12521;&#12508;Wiki&#12434;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12375;&#12383;&#12356;&#22580;&#21512;&#12289;Slingshot Linux VM&#12364;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<a href="Connecting-to-the-Network.html">&#12525;&#12540;&#12459;&#12523;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#25509;&#32154;&#12398;&#20181;&#26041;</a>&#12434;&#12372;&#21442;&#32771;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#25509;&#32154;&#12391;&#12365;&#12383;&#12425;&#12289;&#12479;&#12540;&#12511;&#12490;&#12523;&#12434;&#38283;&#12356;&#12390;&#12289;&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#65306;</p>
<pre>
sec504@slingshot:~$ <b>update-wiki</b>
</pre>

<p>&#20197;&#19978;&#12391;&#12377;&#65281;&#12371;&#12398;&#65297;&#12388;&#12398;&#12467;&#12510;&#12531;&#12489;&#12384;&#12369;&#12391;&#12521;&#12508;Wiki&#12364;&#26368;&#26032;&#29256;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<h2 id="&#12521;&#12508;wiki&#12398;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;--windows">&#12521;&#12508;Wiki&#12398;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488; &ndash; Windows</h2>
<p>Windows 10 VM&#12391;&#12521;&#12508;Wiki&#12434;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12375;&#12383;&#12356;&#22580;&#21512;&#12289;Windows 10 VM&#12364;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<a href="Connecting-to-the-Network.html">&#12525;&#12540;&#12459;&#12523;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#25509;&#32154;&#12398;&#20181;&#26041;</a>&#12434;&#12372;&#21442;&#32771;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#25509;&#32154;&#12391;&#12365;&#12383;&#12425;&#12289;PowerShell&#12503;&#12525;&#12531;&#12503;&#12488;&#12434;&#38283;&#12356;&#12390;&#12289;&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#65306;</p>
<pre>
PS C:\Users\Sec504> <b>update-wiki.ps1</b>
</pre>

<blockquote>
<p>&#27880;&#24847;&#65306;&#12300;&#12467;&#12510;&#12531;&#12489;&#12503;&#12525;&#12531;&#12503;&#12488;&#12301;&#12391;&#12399;&#12394;&#12367;&#12289;&#12300;PowerShell&#12503;&#12525;&#12531;&#12503;&#12488;&#12301;&#12434;&#38283;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#65281;</p>
</blockquote>
<p>&#20197;&#19978;&#12391;&#12377;&#65281;&#12371;&#12398;&#65297;&#12388;&#12398;&#12467;&#12510;&#12531;&#12489;&#12384;&#12369;&#12391;&#12521;&#12508;Wiki&#12364;&#26368;&#26032;&#29256;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<h2 id="&#34920;&#35352;&#19978;&#12398;&#35215;&#32004;">&#34920;&#35352;&#19978;&#12398;&#35215;&#32004;</h2>
<p>&#12521;&#12508;&#12398;&#35500;&#26126;&#12395;&#20197;&#19979;&#12398;&#34920;&#35352;&#19978;&#12398;&#35215;&#32004;&#12364;&#20351;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#65306;</p>
<ul>
<li><em>&#12452;&#12479;&#12522;&#12483;&#12463;&#20307;</em>
<ul>
<li>&#26032;&#12375;&#12356;&#29992;&#35486;&#12420;&#24375;&#35519;&#12375;&#12383;&#12356;&#12392;&#12365;&#12395;&#21033;&#29992;&#12377;&#12427;</li>
</ul></li>
<li><code>&#19968;&#23450;&#12398;&#24133;</code>
<ul>
<li>&#12479;&#12540;&#12511;&#12490;&#12523;&#12398;&#20986;&#21147;&#12289;&#12484;&#12540;&#12523;&#21517;&#12289;&#22793;&#25968;&#21517;&#12289;&#38306;&#25968;&#21517;&#12289;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12289;&#12461;&#12540;&#12527;&#12540;&#12489;&#12394;&#12393;&#12395;&#21033;&#29992;&#12377;&#12427;</li>
</ul></li>
<li><strong>|</strong> (&#22402;&#30452;&#12398;&#32218;)
<ul>
<li>&#22402;&#30452;&#12398;&#32218;&#12399;&#12513;&#12491;&#12517;&#12540;&#25805;&#20316;&#12377;&#12427;&#12392;&#12365;&#12395;&#21033;&#29992;&#12377;&#12427;&#12288;&#65288;&#20363;&#65306; Edit | Paste&#65289;</li>
</ul></li>
</ul>
<p>&#12467;&#12540;&#12489;&#12502;&#12525;&#12483;&#12463;&#12399;&#12484;&#12540;&#12523;&#12398;&#20986;&#21147;&#12395;&#21033;&#29992;&#12375;&#12414;&#12377;&#12290;&#22826;&#23383;&#12399;&#23455;&#34892;&#12377;&#12427;&#12467;&#12510;&#12531;&#12489;&#12391;&#12377;&#12290; &#12383;&#12392;&#12360;&#12400;&#65306;</p>
<pre>
# <b>run_this_command</b>
output from the tool
</pre>

<p>&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#23455;&#34892;&#12377;&#12427;&#12467;&#12510;&#12531;&#12489;&#12395;&#33258;&#20998;&#12364;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#65288;&#27598;&#22238;&#22793;&#12431;&#12427;&#12398;&#12391;&#12371;&#12385;&#12425;&#12391;&#12399;&#20998;&#12363;&#12426;&#12414;&#12379;&#12435;&#65289;&#12381;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12289;&#33258;&#20998;&#12391;&#25351;&#23450;&#12377;&#12427;&#38917;&#30446;&#12399;&#12452;&#12479;&#12522;&#12483;&#12463;&#20307;&#65288;&#26012;&#20307;&#65289;&#12391;&#26360;&#12365;&#12414;&#12377;&#65306;<i><code>yourinput</code></i> _yourinput_&#12398;&#12392;&#12371;&#12429;&#12395;&#12521;&#12508;&#12398;&#35500;&#26126;&#12398;&#12392;&#12362;&#12426;&#33258;&#20998;&#12391;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<blockquote>
<p>&#12371;&#12428;&#12399;TIP&#12289;NOTE&#12289;&#27880;&#24847;&#20107;&#38917;&#12289;&#12362;&#12377;&#12377;&#12417;&#12394;&#12393;&#12391;&#12377;&#12290;</p>
</blockquote>
<h2 id="&#12467;&#12540;&#12473;&#12392;&#12521;&#12508;&#12395;&#12388;&#12356;&#12390;&#12398;&#12501;&#12451;&#12540;&#12489;&#12496;&#12483;&#12463;">&#12467;&#12540;&#12473;&#12392;&#12521;&#12508;&#12395;&#12388;&#12356;&#12390;&#12398;&#12501;&#12451;&#12540;&#12489;&#12496;&#12483;&#12463;</h2>
<p>&#12467;&#12540;&#12473;&#36039;&#26009;&#12395;&#12388;&#12356;&#12390;&#12398;&#12501;&#12451;&#12540;&#12489;&#12496;&#12483;&#12463;&#12418;&#12356;&#12388;&#12391;&#12418;&#12362;&#24453;&#12385;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12496;&#12464;&#12434;&#35211;&#12388;&#12369;&#12414;&#12375;&#12383;&#12363;&#65311;&#26032;&#12375;&#12356;&#12484;&#12540;&#12523;&#12420;&#12486;&#12463;&#12491;&#12483;&#12463;&#12398;&#12362;&#12377;&#12377;&#12417;&#12399;&#12354;&#12426;&#12414;&#12377;&#12363;&#65311;&#12380;&#12402;&#25945;&#12360;&#12390;&#19979;&#12373;&#12356;&#12290;</p>
<p><a href="https://www.sec504.org/feedback">https://www.sec504.org/feedback</a></p>
<p>Josh&#12414;&#12383;&#12399;Mike&#12395;&#30452;&#25509;&#36899;&#32097;&#12375;&#12390;&#38914;&#12356;&#12390;&#12418;&#32080;&#27083;&#12391;&#12377;&#65306;</p>
<ul>
<li>Joshua Wright &ndash; <a href="mailto:jwright@willhackforsushi.com">jwright@willhackforsushi.com</a></li>
<li>Mike Murr &ndash; <a href="mailto:mmurr@codeforensics.net">mmurr@codeforensics.net</a></li>
</ul>
<p>&#12354;&#12426;&#12364;&#12392;&#12358;&#12372;&#12374;&#12356;&#12414;&#12377;&#65281;&#65281;</p>
<p><img  class="myImg"  src="pics/5041.png" style="width:100%;max-width:600px"  alt="504 Challenge Coin" /></p>
<p><em>Update: 20191003-001</em></p>

						</div>
					</div>

		<!-- Scripts -->
			<script src="js/jquery.min.js"></script>
			<script src="js/skel.min.js"></script>
			<script src="js/util.js"></script>
			<script src="js/main.js"></script>

	</body>
</html>
